{"class_name": "Model", "keras_version": "2.1.5", "config": {"output_layers": [["dense_8", 0, 0]], "input_layers": [["input_4", 0, 0]], "name": "model_4", "layers": [{"class_name": "InputLayer", "name": "input_4", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_4", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "name": "block1_conv1", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "name": "block1_conv2", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"trainable": false, "strides": [2, 2], "data_format": "channels_last", "name": "block1_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 128, "data_format": "channels_last", "name": "block2_conv1", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 128, "data_format": "channels_last", "name": "block2_conv2", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"trainable": false, "strides": [2, 2], "data_format": "channels_last", "name": "block2_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "name": "block3_conv1", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "name": "block3_conv2", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "name": "block3_conv3", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"trainable": false, "strides": [2, 2], "data_format": "channels_last", "name": "block3_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "name": "block4_conv1", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "name": "block4_conv2", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"kernel_regularizer": null, "trainable": false, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "name": "block4_conv3", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"trainable": false, "strides": [2, 2], "data_format": "channels_last", "name": "block4_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "name": "block5_conv1", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "name": "block5_conv2", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "name": "block5_conv3", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "block5_pool", "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_4", "config": {"trainable": true, "name": "global_average_pooling2d_4", "data_format": "channels_last"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_7", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "units": 1024, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "name": "dense_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["global_average_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "units": 3, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "name": "dense_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}]}, "backend": "tensorflow"}