{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 64}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 64}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block1_pool", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv1", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv2", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block2_pool", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv1", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 256}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv2", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 256}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv3", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 256}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block3_pool", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv1", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv2", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": false, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv3", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "config": {"pool_size": [2, 2], "trainable": false, "name": "block4_pool", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv1", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv2", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv3", "use_bias": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "config": {"pool_size": [2, 2], "trainable": true, "name": "block5_pool", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "global_average_pooling2d_1", "config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "dense_1", "config": {"units": 1024, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "config": {"units": 2, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "use_bias": true, "activity_regularizer": null}}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.1.5"}