{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.5", "config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1"}}, {"name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block1_conv1", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 64, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block1_conv2", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 64, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block1_pool", "trainable": false, "padding": "valid"}}, {"name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block2_conv1", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 128, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block2_conv2", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 128, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block2_pool", "trainable": false, "padding": "valid"}}, {"name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block3_conv1", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 256, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block3_conv2", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 256, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block3_conv3", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 256, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block3_pool", "trainable": false, "padding": "valid"}}, {"name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block4_conv1", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block4_conv2", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block4_conv3", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": false, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block4_pool", "trainable": false, "padding": "valid"}}, {"name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block5_conv1", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block5_conv2", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block5_conv3", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 512, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1]}}, {"name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block5_pool", "trainable": true, "padding": "valid"}}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}}, {"name": "dense_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "units": 1024, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "name": "dense_1", "bias_constraint": null}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "units": 3, "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "name": "dense_2", "bias_constraint": null}}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}